[
  {
    "id": "scope3_attribution",
    "name": "Scope 3 Attribution",
    "description": "Analyze supplier sustainability programs impact on Scope 3 emissions reduction.",
    "payload_path": "demo/payloads/scope3_attribution.json",
    "suggested_queries": [
      "Which suppliers have the highest emissions reduction potential?",
      "What is the causal effect of supplier programs on Scope 3 emissions?",
      "How do regional differences affect supplier sustainability outcomes?"
    ]
  },
  {
    "id": "causal_discount_churn",
    "name": "Discount vs Churn",
    "description": "Estimate the causal impact of discount on churn.",
    "payload_path": "demo/payloads/causal_estimation.json",
    "suggested_queries": [
      "Estimate impact of discount on churn",
      "Does offering a discount reduce customer churn?",
      "What is the causal effect of discounts controlling for region and tenure?"
    ]
  },
  {
    "id": "bayesian_conversion_rate",
    "name": "Conversion Belief Update",
    "description": "Update belief on conversion rate with binomial data.",
    "payload_path": "demo/payloads/bayesian_inference.json",
    "suggested_queries": [
      "Update belief on our conversion rate",
      "What is the posterior distribution of the conversion rate given 42 successes in 100 trials?",
      "How confident should we be in our current conversion rate estimate?"
    ]
  },
  {
    "id": "renewable_energy_roi",
    "name": "Renewable Energy ROI",
    "description": "Estimate ROI from renewable energy investments across facilities.",
    "payload_path": "demo/payloads/renewable_energy_roi.json",
    "suggested_queries": [
      "What is the ROI of solar panel installations across our facilities?",
      "Does renewable energy investment causally reduce operating costs?",
      "Which facility types benefit most from renewable energy?"
    ]
  },
  {
    "id": "shipping_carbon_footprint",
    "name": "Shipping Mode Analysis",
    "description": "Analyze how shipping mode changes affect carbon footprint.",
    "payload_path": "demo/payloads/shipping_carbon.json",
    "suggested_queries": [
      "How does switching shipping modes affect carbon footprint?",
      "What is the causal impact of rail vs truck shipping on emissions?",
      "Estimate the emissions reduction from optimizing freight logistics"
    ]
  },
  {
    "id": "supply_chain_resilience",
    "name": "Supply Chain Resilience",
    "description": "Analyze climate stress impact on supply chain disruption risk using 2000 supplier records.",
    "payload_path": "demo/payloads/supply_chain_resilience.json",
    "suggested_queries": [
      "What is the causal impact of climate stress on supply chain disruption risk?",
      "How does operational maturity reduce disruption risk under climate stress?",
      "Which supplier regions are most vulnerable to climate-driven disruptions?"
    ]
  },
  {
    "id": "pricing_optimization",
    "name": "Pricing Strategy Optimization",
    "description": "Analyze causal impact of price changes on sales volume across market segments.",
    "payload_path": "demo/payloads/pricing_optimization.json",
    "suggested_queries": [
      "What is the causal effect of price increases on sales volume?",
      "How does market segment affect price sensitivity?",
      "Which product categories are most price elastic?"
    ]
  },
  {
    "id": "market_adoption",
    "name": "New Product Market Adoption",
    "description": "Model uncertainty in new product market adoption using Bayesian inference for Complex domain analysis.",
    "payload_path": "demo/payloads/market_adoption.json",
    "suggested_queries": [
      "What is the probability that our adoption rate exceeds 50%?",
      "How does uncertainty in adoption change with more data?",
      "What should we probe next to reduce adoption uncertainty?"
    ]
  },
  {
    "id": "crisis_response",
    "name": "Supply Chain Crisis Response",
    "description": "Chaotic domain scenario simulating critical supplier failure requiring immediate stabilization.",
    "payload_path": "demo/payloads/crisis_response.json",
    "suggested_queries": [
      "Critical supplier just failed - what immediate actions should we take?",
      "System is experiencing cascading failures - stabilize now!",
      "Emergency: 5 suppliers offline, need crisis response plan"
    ]
  },
  {
    "id": "data_lookup",
    "name": "Inventory Data Lookup",
    "description": "Clear domain scenario for simple deterministic inventory and product queries.",
    "payload_path": "demo/payloads/data_lookup.json",
    "suggested_queries": [
      "What is the current stock level for product X?",
      "List all products in Electronics category",
      "Show me supplier contact information"
    ]
  }
]
